//========================================= Լիանա Մարդանյան ===============================
//========================================= Homework16 ====================================

/*1. Ստեղծել homework1.js ֆայլ որը աշխատեցնելուց հետո __filename գլոբալի  
միջոցով console-ում արտածել ֆայլի բացարձակ ճանապարը և  ճանապարհի անվան երկարությունը
*/
// console.log(__filename);
/*2. Ստեղծել package.json  ֆայլ որը կունենա  home2.jpg տեսքը, որտեղ author դիմաց կլինի Ձեր անուն ազգանունը:
homework2.js ֆայլի միջոցով օգտագործելով random փաթեթը  console-ում արտածել 5 պատհական int արժեքներ 0 - 100 
միջակայքում:*/
/*3. Modules պապակայում ստեղծել currentTime մոդուլ currentTime ֆունկցիայով որը արտածում է  կանչելու պահին 
ժամը, րոպեն ,վարկյանը և միլիվայրկյանը :
Մոդուլը ներմուծել homework3.js ֆայլում և կանչել currentTime ֆունկցիավ  ու արդյունքը արտածել console-ում:

4.Modules պապակայում ստեղծել wordsFromString մոդուլ wordsFromString ֆունկցիայով որը տրված նախադասությունից 
console-ում  արտածում է այն բառերը որոնք չունեն հատուկ սիմվոլ: 
Մոդուլը ներմուծել homework4.js ֆայլում և wordsFromString ֆունկցիավ կանչել որևէ նախադասության համար:  
*/
